publish/monotone-stack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-27 Fri 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>单调栈</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">单调栈</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfdd80dc">定义</a></li>
<li><a href="#org3d9f3fb">性质</a></li>
<li><a href="#org252d13c">巧记</a></li>
<li><a href="#org95bc9bc">练习题</a></li>
<li><a href="#org6ffd18f">Refs</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfdd80dc" class="outline-2">
<h2 id="orgfdd80dc">定义</h2>
<div class="outline-text-2" id="text-orgfdd80dc">
<p>
单调栈即满足单调性的栈结构，插入时要保证栈的单调性。
</p>

<p>
它适合解决那些需要找到 <code>下一个/上一个更大/小值</code> 的问题。
</p>

<p>
按照从 <code>栈顶到栈底</code> 的顺序，递增则为单调递增栈，递减则为单调递减栈。
</p>

<p>
左侧为栈底，右侧为栈顶：
</p>

<p>
单调递增栈：[5,4,3,2,1]
</p>

<p>
单调递减栈：[1,2,3,4,5]
</p>

<p>
对于单调栈，在 <code>插入</code> 时，需要去比较入栈元素和栈顶元素的大小。
</p>

<p>
以单调递增栈为例子，要保证从栈顶到栈底是递增的关系。
</p>

<p>
入栈时，要保持栈顶的元素大于等于入栈的元素。
</p>

<p>
如果栈顶元素比入栈元素小，则将栈顶元素弹出，直到栈顶元素大于等于入栈元素，或者栈为空。
</p>
</div>
</div>
<div id="outline-container-org3d9f3fb" class="outline-2">
<h2 id="org3d9f3fb">性质</h2>
<div class="outline-text-2" id="text-org3d9f3fb">
<p>
对于数组 [5,2,3,7,1]
</p>

<p>
按照从左到右遍历数组，构造单调递增栈(左边栈低，右边栈顶):
</p>

<ul class="org-ul">
<li><code>[]</code></li>
<li><code>[5]</code> 栈为空，入栈 5</li>
<li><code>[5,2]</code> 栈顶 5 大于 2，入栈 2</li>
<li><code>[5,3]</code> 栈顶 2 小于 3，弹出 2；弹出后，栈顶 5 大于 3，入栈 3。
<code>观察此时的序列，通过序列可以知道，对于入栈元素 3，左边第一个比它大的元素是 5</code></li>
<li><code>[7]</code> 栈顶 3 小于 7，弹出 3；栈顶 5 小于 7，弹出 5；栈为空，入栈 7</li>
<li><code>[7,1]</code> 栈顶 7 大于 1， 入栈 1</li>
</ul>

<p>
对于单调 <code>递增</code> 栈，当 <code>从左到右</code> 遍历进行入栈时，单调递增栈的序列表示的
是， <code>左边第一个大于等于入栈元素的数</code> 。
</p>

<p>
当 <code>从右往左</code> 入栈时，单调递增栈序列表示的是， <code>右边第一个大于等于入
  栈元素的数</code> 。
</p>

<p>
而单调 <code>递减</code> 栈则可以用来找 <code>第一个比入栈元素小的数</code> 。
</p>

<p>
有的问题，还需要限制 <code>严格递增或者严格递减</code> ，即栈序列都是严格递增递减
的，不会出现相等的元素， 例如<a href="https://leetcode.cn/problems/daily-temperatures/">739. 每日温度</a>。
</p>
</div>
</div>
<div id="outline-container-org252d13c" class="outline-2">
<h2 id="org252d13c">巧记</h2>
<div class="outline-text-2" id="text-org252d13c">
<ul class="org-ul">
<li>要寻找 <code>更小值</code> ，那么就要形成变 “小” 的单调栈，所以选择 <code>单调递减栈</code> ，如果要找 <code>左边</code> 第一个更小值，就从 <code>左边</code> 开始遍历</li>

<li>要寻找 <code>更大值</code> ，那么就要形成变 “大” 的单调栈，所以选择 <code>单调递增栈</code> ，如果要找 <code>左边</code> 第一个更大值，就从 <code>左边</code> 开始遍历</li>
</ul>
</div>
</div>
<div id="outline-container-org95bc9bc" class="outline-2">
<h2 id="org95bc9bc">练习题</h2>
<div class="outline-text-2" id="text-org95bc9bc">
<ul class="org-ul">
<li><a href="https://leetcode.cn/problems/daily-temperatures/">739. 每日温度</a></li>
<li><a href="https://leetcode.cn/problems/sum-of-subarray-minimums/">907. 子数组的最小值之和</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6ffd18f" class="outline-2">
<h2 id="org6ffd18f">Refs</h2>
<div class="outline-text-2" id="text-org6ffd18f">
<ul class="org-ul">
<li><a href="https://blog.hackerpie.com/posts/algorithms/monotonous-stacks/monotonous-stacks/">数据结构：单调栈</a>@HackerPie</li>
<li><a href="https://oi-wiki.org/ds/monotonous-stack/">单调栈</a>@OI WIKI</li>
<li><a href="https://github.com/labuladong/fucking-algorithm/blob/master/%E6%95%B0%E6%8D%AE%E7%BB%93%E6%9E%84%E7%B3%BB%E5%88%97/%E5%8D%95%E8%B0%83%E6%A0%88.md">如何使用单调栈解题</a>@labuladong/fucking-algorithm</li>
<li><a href="https://suanfa8.com/data-structure-basic/stack/practice/">4.4 栈的练习</a>@算法吧</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2022-08-22 Mon 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://utteranc.es/client.js" repo="Spike-Leung/taxodium" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script>
</div>
</body>
</html>
